{
    "Blogs": [
        {
            "Date": "Aug 27, 2020",
            "Img": "img/victoria-priessnitzpublic/img/victoria-priessnitz-ZJD7HUBIlSc-unsplash.jpg",
            "Title": "Awesome Inc's Bootcamp has begun!",
            "P1": "A great first week!",
            "P2": "After being excited about this program for a while, I was happy to jump into the work right away. From what I had heard, I anticipated a large amount of reading, and so far it's to the level that I expected. I imagined that there would be an enormous amount to cover in just 16 weeks, and I have a feeling that it's only going to get harder from here. But I know that if I keep at it every day and do my best to challenge myself, then the effort is sure to pay off.",
            "P3": "Right now, my roadblock might be getting backgrounds and images to work the way I want them. On this first draft of the blog, I had some trouble getting a nice background image to function with these article blocks, but I couldn't quite make it work - you might see some unsightly seams along the sides from my clumsy attempt. I'm glad I made the effort to see whether I could do it however, and am eager to learn more in the next week and maybe push this blog a little bit further!"
        },
        {
            "Date": "Sept 4, 2020",
            "Img": "img/adolfo-felix-Yi9-QIObQ1o-unsplash.jpg",
            "Title": "Exploring Pseudocode!",
            "P1": "Hello again! It's been another long, yet exciting week at Awsome Inc's Bootcamp.",
            "P2": "This week while studying a bit of basic HTML and CSS, we began to practice our pseudocoding skills as well! I'll admit that I still don't feel very confident writing pseudocode, however, it was fun to take a project from just a simple idea like an 'Ice Making Machine' and approach it from a coding viewpoint.",
            "P3": "Finding the right balance to spend on learning new things, while working to improve old projects - like this blog D: - proved to be a bit of a challenge. So I will take that as a cue for me to work on improving myself in managing these new tasks while keeping my mind open as to how new topics can improve existing works!"
        },
        {
            "Date": "Sept 11, 2020",
            "Img": "img/claudio-schwarz-purzlbaum-i25aqE_YUZs-unsplash.jpg",
            "Title": "Oh boy, Javascript!",
            "P1": "I have been both looking forward to getting back into Javascript since first learning it in the Intro, as well as dreading the difficulty of my mental math skills.",
            "P2": "Overall, the tasks this week were fun and enjoyable, especially the silly story generator. This blog doesn't have any javascript yet, however, that is mainly due to my lack of imagination. Being able to recognize when to use javascript, and in what ways I can apply it, is just a skill that I will have to keep developing as this bootcamp continues.",
            "P3": "Now that I've seen all three slices of the cake: HTML, CSS, and Javascript; I can now safely guage my lacking skills with all three, though my understanding of CSS probably feels the most shallow, even if its importance in the bootcamp feels less stressed than the other two. Still, I hope to keep working on both my knowledge and understanding, and my persistence should give way to clearer thoughts on unique ways to improve myself and this blog!"
        },
        {
            "Date": "Sept 18, 2020",
            "Img": "img/jeshoots-com--2vD8lIhdnw-unsplash.jpg",
            "Title": "Oh GOD, JAVASCRIPT!",
            "P1": "I was right to be afraid of math! Thankfully, google is my friend and research during the week saved me for when I was attempting to complete my Digital Clock and Countdown projects.",
            "P2": "Overall, the tasks this week were fun, albeit more challenging. The Pre-Work in general has been challenging and fun at the same time. I'm not sure I could have had a more honest experience in learning the foundations for web development than I have these past four weeks. All the resources our instructors gave us were helpful and meaningful, progress never felt difficult as long as I was determined to understand and seek answers, and overcoming the difficult parts of this pre-work was helped by the fantastic assistance I received from both the 'help' channel on Slack and my instructors and classmates.",
            "P3": "I'm excited to begin work next week in-person at the offices, and can't wait to learn more about the Front End of web development!"
        },
        {
            "Date": "Sept 25, 2020",
            "Img": "img/adolfo-felix-Yi9-QIObQ1o-unsplash.jpg",
            "Title": "It's a LOT!",
            "P1": "It's our first real week at Awesome Inc., and BOY it's a lot!!",
            "P2": "I can't really explain why the work is both exhausting and really fun. I've been working through projects and stuff for about 40-50 hours already this week, and I am ready for the weekend! There were some major problems and blocks that happened, but I'm happy to have pushed through them and made it through my projects pretty well thanks to both Ian and Justin's help. The codewars kata's were a lot of fun, and I was able to solve them all except for the last one we had this week which was REALLY HARD!",
            "P3": "I'd like to thank everyone again at Awesome for their help and teachings, I am excited to continue and work hard for the next week as well!"
        },
        {
            "Date": "Oct 2, 2020",
            "Img": "img/Woods.jpeg",
            "Title": "Sixth Week at Awesome!",
            "P1": "This week was busy as usual, but I feel like I'm falling into a good rhythm. There's a lot to learn and it never feels like there's enough time in the day to both learn and finish my projects, but somehow things have been moving smoothly one way or another.",
            "P2": "We had our weekly reviews this week. I was very happy with the criticism I got and was glad that the people here at Awesome were looking at us properly while we did our work. Their expectations and review of our progress was very encouraging, and I'll try to keep up this good momentum and see if I can better myself over the weekend as well.",
            "P3": "For our projects, we had to get our blog's bootstrap-oriented, as well as create a weather api, which was hard, and although I still don't quite understand api's I'm happy with the project results. We also started on the Tic-Tac-Toe project for next week, and I am very glad to have started early, since the concepts for creating it were tough for me to wrap my head around at first. Overall, a good week! I hope next week will be even better!"
        },
        {
            "Date": "",
            "Img": "",
            "Title": "",
            "P1": "",
            "P2": "",
            "P3": ""
        },
        {
            "Date": "",
            "Img": "",
            "Title": "",
            "P1": "",
            "P2": "",
            "P3": ""
        }
    ]
}